aeverson/my_api/app/controllers/tasks_controller.rb

	def index
		render json: Task.all
---
SELECT "tasks".* FROM "tasks"

	def create
		@task = Task.new(json_data['task'])
		@task.save
---
INSERT INTO "tasks" ("body", "complete", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "first api task"], ["complete", "f"], ["created_at", "2016-03-13 21:02:48.922250"], ["updated_at", "2016-03-13 21:02:48.922250"]]

	def show
		@task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]

	def update
		@task = Task.find(params[:id])
		data = json_data['task']
		@task.update(data)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "tasks" SET "complete" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["complete", "t"], ["updated_at", "2016-03-13 21:12:07.294910"], ["id", 1]]

	def destroy
		@task = Task.find(params[:id])
		render json: @task.delete()
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]